Merge pull request #3 from CodeHunt101/docs/diagrams
docs: Add architecture and workflow diagrams
